// 5. Напишите программу, которая на вход принимает одно число (N), 
// а на выходе показывает все целые числа в промежутке от -N до N.

// 4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
// 2 -> " -2, -1, 0, 1, 2"

Console.Clear();
int count = 0;
int n = 0;
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine());
while (n < number)
{
    n = -1 * number + 1
}


 Console.Write($"{n}, ");

count++;